%% ----电压骤降+谐波信号----
        fs=5120;%采样率;
        f0=50;%电网基波频率;
        N=10*fs/f0;%采样点数(总共10个周波);
        n=0:N-1;%时间序列;
        t=n/fs;%时间间隔;
        a2=0.1+rand(1,1)*0.8;%骤降比例系数;
        t1=0;
        t2=0;
        while (t2-t1<0.02)||(t2-t1 > 0.18)%不满足约束条件:T<t2-t1<9T，则一直为真；
                t1=rand(1,1)*0.18;%0.02=<t2-t1=<0.18;
                t2=0.02+rand(1,1)*0.18;
        end
        a2=0.5;t1=0.05;t2=0.15;%根据实际情况确定
        ntemp=0:N-1;
        u1step=(ntemp-t1*fs)>=0;%求出t1的阶跃时刻;
        u2step=(ntemp-t2*fs)>=0;%求出t2的阶跃时刻;
%         a7=0.05+rand(1,1)*0.25;%3次谐波含量在0.05~0.3之间;
%         b7=0.05+rand(1,1)*0.25;%5次谐波含量在0.05~0.3之间;
%         c7=0.05+rand(1,1)*0.25;%7次谐波含量在0.05~0.3之间;
        a7=0.3;b7=0.1;c7=0.2;%谐波参数设置方法  基于改进S变换的电能质量扰动信息特征提取方法  吴禹 
%         signal=(1-a2*(u1step-u2step)).*(sin(2*pi*f0*n/fs)+a7*sin(2*pi*3*f0*n/fs)+b7*sin(2*pi*5*f0*n/fs)+c7*sin(2*pi*7*f0*n/fs));
        sign=(1-a2*(u1step-u2step)).*(sin(2*pi*f0*n/fs)+a7*sin(2*pi*3*f0*n/fs)+b7*sin(2*pi*5*f0*n/fs)+c7*sin(2*pi*7*f0*n/fs));
        sign=noisegen(sign,snr);
        plot(n,sign);